src/traffic/jmeter_configs/flashsale_e3_50x.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="FlashSale E3 - 50x" enabled="true">
      <stringProp name="TestPlan.comments">E3 - 50x: 5000 target requests/s, 200 threads. Override ALB_DNS at CLI: -JALB_DNS=...</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp><boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments">
        <elementProp name="ALB_DNS" elementType="Argument"><stringProp name="Argument.name">ALB_DNS</stringProp><stringProp name="Argument.value">${__P(ALB_DNS,localhost)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
        <elementProp name="TARGET_RPS" elementType="Argument"><stringProp name="Argument.name">TARGET_RPS</stringProp><stringProp name="Argument.value">5000</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
      </collectionProp></elementProp>
    </TestPlan><hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="100 threads - 10s ramp + 300s peak" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><intProp name="LoopController.loops">-1</intProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp><stringProp name="ThreadGroup.ramp_time">10</stringProp><stringProp name="ThreadGroup.duration">310</stringProp><stringProp name="ThreadGroup.delay">0</stringProp><boolProp name="ThreadGroup.scheduler">true</boolProp>
      </ThreadGroup><hashTree>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Target throughput (requests/minute)" enabled="true"><doubleProp name="throughput"><name>throughput</name><value>${__javaScript(${TARGET_RPS}*60)}</value><savedValue>0.0</savedValue></doubleProp><intProp name="calcMode">1</intProp></ConstantThroughputTimer><hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /request" enabled="true"><stringProp name="HTTPSampler.domain">${ALB_DNS}</stringProp><stringProp name="HTTPSampler.port"></stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><stringProp name="HTTPSampler.path">/request</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.auto_redirects">false</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp><stringProp name="HTTPSampler.embedded_url_re"></stringProp><stringProp name="HTTPSampler.connect_timeout">5000</stringProp><stringProp name="HTTPSampler.response_timeout">30000</stringProp></HTTPSamplerProxy><hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report - P95/P99 and throughput" enabled="true"><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><threadName>true</threadName><dataType>true</dataType><encoding>false</encoding><assertions>true</assertions><subresults>true</subresults><responseData>false</responseData><samplerData>false</samplerData><xml>false</xml><fieldNames>true</fieldNames><responseHeaders>false</responseHeaders><requestHeaders>false</requestHeaders><responseDataOnError>false</responseDataOnError><saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage><assertionsResultsToSave>0</assertionsResultsToSave><bytes>true</bytes><sentBytes>true</sentBytes><url>true</url><threadCounts>true</threadCounts><idleTime>true</idleTime><connectTime>true</connectTime></value></objProp><stringProp name="filename">${__P(JTL,results/e3_50x.jtl)}</stringProp></ResultCollector><hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report - throughput" enabled="true"><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><threadName>true</threadName><dataType>true</dataType><encoding>false</encoding><assertions>true</assertions><subresults>true</subresults><responseData>false</responseData><samplerData>false</samplerData><xml>false</xml><fieldNames>true</fieldNames><responseHeaders>false</responseHeaders><requestHeaders>false</requestHeaders><responseDataOnError>false</responseDataOnError><saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage><assertionsResultsToSave>0</assertionsResultsToSave><bytes>true</bytes><sentBytes>true</sentBytes><url>true</url><threadCounts>true</threadCounts><idleTime>true</idleTime><connectTime>true</connectTime></value></objProp><stringProp name="filename"></stringProp></ResultCollector><hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>